[
{"text": "I love a man with a great sense of humor and who is intelligent - a man who has a great smile. He has to make me laugh. I like a man who is very ambitious and driven and who has a good heart and makes me feel safe. I like a man who is very strong and independent and confident - that is very sexy - but at the same time, he's very kind to people.", "author": "Nicole Scherzinger", "tags": ["Smile", "Love", "Good", "Sexy"]},
{"text": "Girl power is about loving yourself and having confidence and strength from within, so even if you're not wearing a sexy outfit, you feel sexy.", "author": "Nicole Scherzinger", "tags": ["Strength", "Confidence", "Sexy", "Yourself"]},
{"text": "You cry and you scream and you stomp your feet and you shout. You say, 'You know what? I'm giving up, I don't care.' And then you go to bed and you wake up and it's a brand new day, and you pick yourself back up again.", "author": "Nicole Scherzinger", "tags": ["Morning", "Day", "Yourself", "You"]},
{"text": "Confidence comes with maturity, being more accepting of yourself.", "author": "Nicole Scherzinger", "tags": ["Confidence", "Yourself", "Maturity", "Being"]},
{"text": "I definitely have the eye of the tiger. I've fought my way to where I am and will continue to do so. I'm a hard worker - I get it from my family. We only know work. Nothing was handed to us. When I believe in something, I go after it. It's very hard to tell me 'no.'", "author": "Nicole Scherzinger", "tags": ["Work", "Family", "Me", "I Am"]},
{"text": "When you break a sweat you just feel great. You've got your endorphins going. You feel better. You look better. And if you aren't able to get a workout in, try to find a steam room somewhere. You just look and feel so much better after a sweat.", "author": "Nicole Scherzinger", "tags": ["You", "Feel", "Look", "Great"]},
{"text": "I'm a strong believer in 'everything is meant to be for a reason.'", "author": "Nicole Scherzinger", "tags": ["Strong", "Meant To Be", "Everything", "Reason"]},
{"text": "It's important for a woman to feel good in her clothes. It's OK to have curves and to work them.", "author": "Nicole Scherzinger", "tags": ["Work", "Good", "Woman", "Feel"]},
{"text": "I've always had a fighter's spark in me. I was born with it. I think it's in my blood.", "author": "Nicole Scherzinger", "tags": ["Me", "Think", "Born", "Blood"]},
{"text": "Growing up, I was very conservative in my wardrobe, so when I first joined the Pussycat Dolls, the biggest challenge was wearing those cabaret costumes. I didn't feel comfortable showing my body so much, showing my legs and butt, chest and midriff.", "author": "Nicole Scherzinger", "tags": ["Challenge", "Feel", "Body", "Growing Up"]},
{"text": "I come from a strong religious background, and I had a very conservative upbringing. So I was nervous, and confused. Here I was wanting to be Whitney Houston, so why did I have to dress in lingerie to do that? I didn't get it.", "author": "Nicole Scherzinger", "tags": ["Dress", "Strong", "Confused", "Nervous"]},
{"text": "I love making down-home Southern cooking, and just chilling out and having cakes and pies and baking stuff, you know. I'm a pretty simple girl.", "author": "Nicole Scherzinger", "tags": ["Love", "Simple", "Girl", "You"]},
{"text": "I think shoulders are sexier than cleavage.", "author": "Nicole Scherzinger", "tags": ["Think", "Shoulders", "I Think", "Than"]},
{"text": "I think the sexiest thing about a man is that he's confident. Sure, sometimes you meet someone and you see his appearance first, but then you get to know him, and he looks completely different to you.", "author": "Nicole Scherzinger", "tags": ["Man", "You", "Sometimes", "Think"]},
{"text": "I don't really believe in diets. I love food... If I deprive myself, I'm going to want it more. I snack on yogurt, raw cashews and cherry tomatoes.", "author": "Nicole Scherzinger", "tags": ["Love", "Myself", "Food", "Believe"]},
{"text": "I don't like my thighs, the back of my legs or my chubby knees. I wear clothes that show off my legs in pictures and videos but not often when I'm appearing live.", "author": "Nicole Scherzinger", "tags": ["Clothes", "Pictures", "Live", "Back"]},
{"text": "I was a very quiet, shy child. I grew up in a small town, Louisville, Kentucky, and there weren't too many Hawaiian-Filipino girls, so I stuck out like a sore thumb. I didn't look like everyone else and didn't feel I belonged... But these things only build character and make you stronger. It taught me to grow into the woman I was to become.", "author": "Nicole Scherzinger", "tags": ["Me", "You", "Character", "Woman"]},
{"text": "I'm no diva but I can be annoying in a recording studio. Of course I try to be a diva in terms of confidence of performance and owning a song but I've never behaved like one in terms of the negative connotations of the word.", "author": "Nicole Scherzinger", "tags": ["Confidence", "Song", "Negative", "I Can"]},
{"text": "If believing in yourself and going after what you want in life and realising your worth is ruthless and selfish, then I'm definitely ruthless and selfish.", "author": "Nicole Scherzinger", "tags": ["Life", "Yourself", "You", "Selfish"]},
{"text": "I can be quite daring with my clothes but I believe that you have to feel comfortable and confident to carry off whatever it is you're wearing.", "author": "Nicole Scherzinger", "tags": ["You", "Believe", "Feel", "Clothes"]},
{"text": "I'm way better in person than I am on things like Twitter. I know Twitter is the best and fastest way to connect with fans who really appreciate you but I'm still not cool with it - although I am trying! I try my best but I'm a one-on-one person and I don't want to tell people I'm on the toilet or I just brushed my teeth.", "author": "Nicole Scherzinger", "tags": ["Best", "Cool", "I Am", "You"]},
{"text": "I'm going to take care of the man I'm with. I grew up in a household where my mum takes care of my dad - she cooks, she does everything - and that's the kind of girl I am.", "author": "Nicole Scherzinger", "tags": ["Man", "I Am", "Girl", "Care"]},
{"text": "In normal life people say, 'You're so different than on stage!' Offstage I'm down to earth, simple and a very goofy girl... I like to make goofy faces, be dorky and not take things too seriously. I just love to laugh.", "author": "Nicole Scherzinger", "tags": ["Life", "Love", "Simple", "Girl"]},
{"text": "My bulimia was my addiction. Hurting myself was my addiction... The music is what saved me. That's the only thing I can trust.", "author": "Nicole Scherzinger", "tags": ["Myself", "Music", "Me", "Trust"]},
{"text": "A lot of songs are empowering because everybody who has been through a hard time in a relationship or in their lives can relate to it.", "author": "Nicole Scherzinger", "tags": ["Relationship", "Time", "Hard", "Through"]},
{"text": "I was a shy kid, but somehow I knew I would make it as a performer. I'd always be telling my mum that I was going to be a famous singer. In my school yearbooks I would write, 'Remember me when I'm famous.' I knew I had a gift.", "author": "Nicole Scherzinger", "tags": ["Me", "School", "Gift", "Remember"]}
]